``` Terraform will perform the following actions:

  # aws_route53_record.dokku-dns will be created
  + resource "aws_route53_record" "dokku-dns" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "apps.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z386N8B8JBC6TQ"
    }

  # aws_route53_record.dokku-dns-wildcard will be created
  + resource "aws_route53_record" "dokku-dns-wildcard" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.apps.galaxyproject.eu"
      + records         = [
          + "apps.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z386N8B8JBC6TQ"
    }

  # openstack_compute_instance_v2.dokku will be created
  + resource "openstack_compute_instance_v2" "dokku" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = "Ubuntu 22.04"
      + key_pair            = "cloud2"
      + name                = "apps.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "egress",
          + "public-ping",
          + "public-ssh",
          + "public-web2",
        ]
      + stop_before_destroy = false

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_volume_attach_v2.dokku-va will be created
  + resource "openstack_compute_volume_attach_v2" "dokku-va" {
      + device      = "/dev/vdb"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = "6cbce9f7-1ffd-4848-9ec8-0a2ccfd52225"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```